SS-Electronics/FreeRTOS-OS/arch/devices/STM/STM32H7xx/STM32H723/startup_stm32h723zx.c
#include <stdint.h>
#include "def_attributes.h"

/* SCB_EnableICache / SCB_EnableDCache from core_cm7.h via stm32h7xx.h → stm32_h723xx.h.
 * -I arch/devices/STM/STM32H7xx resolves <stm32h7xx.h>; -DSTM32H723xx selects sub-header. */
#include <stm32h7xx.h>

/* SystemInit is implemented in drivers/hal/stm32/hal_rcc_stm32.c */
void SystemInit(void);


/* Symbols from linker script */
extern uint32_t _estack;  /* Stack pointer end */

extern uint32_t _sidata;  /* LMA of .data in Flash */
extern uint32_t _sdata;   /* start of .data in RAM */
extern uint32_t _edata;   /* end of .data in RAM */
extern uint32_t _sbss;    /* start of .bss in RAM */
extern uint32_t _ebss;    /* end of .bss in RAM */

extern void main(void);

__SECTION_BOOT void __libc_init_array(void);

/* Default handler */
__SECTION_BOOT __attribute__((used)) void Default_Handler(void)
{
    while (1)
    {

    }
}

/* Cortex-M7 exception handlers (weak aliases to Default_Handler) */
void Reset_Handler(void);
void NMI_Handler(void)              __attribute__((weak, alias("Default_Handler"),used));
void HardFault_Handler(void)        __attribute__((weak, alias("Default_Handler"),used));
void MemManage_Handler(void)        __attribute__((weak, alias("Default_Handler"),used));
void BusFault_Handler(void)         __attribute__((weak, alias("Default_Handler"),used));
void UsageFault_Handler(void)       __attribute__((weak, alias("Default_Handler"),used));
void SVC_Handler(void)              __attribute__((weak, alias("Default_Handler"),used));
void DebugMon_Handler(void)         __attribute__((weak, alias("Default_Handler"),used));
void PendSV_Handler(void)           __attribute__((weak, alias("Default_Handler"),used));
void SysTick_Handler(void)          __attribute__((weak, alias("Default_Handler"),used));

/* Peripheral IRQ handler weak forward declarations (AUTO-GENERATED).
 * Default_Handler must be visible in this translation unit — include only here. */
#include <board/irq_periph_handlers_generated.h>

/* Vector table (goes into .isr_vector section at FLASH_BOOT origin) */
__attribute__((section(".isr_vector")))
const void* const g_pfnVectors[] =
{
    /* ── System / Cortex-M7 core handlers ───────────────────────────────────── */
    &_estack,
    Reset_Handler,          /* Reset                  */
    NMI_Handler,            /* NMI                    */
    HardFault_Handler,      /* Hard Fault             */
    MemManage_Handler,      /* MPU Fault              */
    BusFault_Handler,       /* Bus Fault              */
    UsageFault_Handler,     /* Usage Fault            */
    0,                      /* Reserved               */
    0,                      /* Reserved               */
    0,                      /* Reserved               */
    0,                      /* Reserved               */
    SVC_Handler,            /* SVCall                 */
    DebugMon_Handler,       /* Debug Monitor          */
    0,                      /* Reserved               */
    PendSV_Handler,         /* PendSV                 */
    SysTick_Handler,        /* SysTick                */

    /* ── Peripheral IRQ vectors (AUTO-GENERATED from irq_table.xml) ──────────── */
#include <board/irq_periph_vectors_generated.inc>
};

/* Reset Handler implementation */
__SECTION_BOOT __USED __attribute__((noreturn)) void Reset_Handler(void)
{
    uint32_t *src, *dst;

    /* Stack pointer init */
__asm volatile (
    "ldr r0, =g_pfnVectors\n\t"
    "ldr sp, [r0]"
    );

    /* Enable Cortex-M7 instruction and data caches before any memory access.
     * Must happen before SystemInit so PLL/flash-wait-state setup benefits
     * from cache; SCB_EnableICache/SCB_EnableDCache are no-ops if already on. */
    SCB_EnableICache();
    SCB_EnableDCache();

    /* System init (clocks, VOS, PLL, flash latency, etc.) */
    SystemInit();

    /* Copy .data section from Flash to DTCM */
    for (dst = &_sdata, src = &_sidata; dst < &_edata; )
    {
        *dst++ = *src++;
    }

    /* Zero initialize .bss section */
    for (dst = &_sbss; dst < &_ebss; )
    {
        *dst++ = 0;
    }

    /* Run static constructors (C++ support) */
    __libc_init_array();

    /* Call main */
    main();

    /* If main ever returns, trap CPU */
    while (1)
    {

    }
}
